app/Controllers/Api/Pelicula.php

    public function paginado_full() {
        $peliculas = $this->model
        ->when($this->request->getGet('buscar'), static function($query, $buscar){
            $query->groupStart()->orLike('peliculas.titulo', $buscar, 'both');
            $query->orLike('peliculas.descripcion', $buscar, 'both')->groupEnd();
        })
        ->when($this->request->getGet('categoria_id'), static function($query, $categoriaId){
---
SELECT *
FROM `peliculas`