app/Controllers/Web/Usuario.php

SELECT `id`, `usuario`, `email`, `clave`, `tipo`
FROM `usuarios`
WHERE `email` = 'admin@gmail.com'
OR `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function loginPost() {
        $usuarioModel = new UsuarioModel();

        $email = $this->request->getPost('email'); //email o usuario
        $clave = $this->request->getPost('clave'); //contraseña

        $usuario = $usuarioModel->select('id,usuario,email,clave,tipo')
        ->orWhere('email', $email)
        ->orWhere('email', $email)
        ->first();