app/Controllers/Dashboard/Categoria.php

SELECT *
FROM `categorias`
---
    public function index()
    {
        session()->set('key', 'value');
        $categoriaModel = new CategoriaModel();

        echo view('dashboard/categoria/index', [
            'categorias' => $categoriaModel
            ->paginate(10), 'pager' => $categoriaModel->pager
            //->findAll()
        ]);