app/Controllers/Dashboard/Etiqueta.php

SELECT `etiquetas`.*, `categorias`.`titulo` as `categoria`
FROM `etiquetas`
JOIN `categorias` ON `categorias`.`id` = `etiquetas`.`categoria_id`
---
    public function index() {
        $etiquetaModel = new EtiquetaModel();

        $data = [
            'etiquetas' => $etiquetaModel
            ->select('etiquetas.*, categorias.titulo as categoria')
            ->join('categorias', 'categorias.id = etiquetas.categoria_id')
            ->paginate(10), 'pager' => $etiquetaModel->pager
            //->find()
        ];

SELECT *
FROM `categorias`
---
    public function new() {

        $categoriaModel = new CategoriaModel();


        echo view('dashboard/etiqueta/new', [
            'etiqueta' => new EtiquetaModel(),
            'categorias' => $categoriaModel->find()
        ]);