app/Controllers/Dashboard/Pelicula.php

DELETE FROM `pelicula_etiqueta`
WHERE `etiqueta_id` = '15)'
AND `pelicula_id` = '3'
---
    public function etiqueta_delete($id, $etiquetaId) {
        $peliculaEtiquetaModel = new PeliculaEtiquetaModel();

        $peliculaEtiquetaModel
        ->where('etiqueta_id', $etiquetaId)
        ->where('pelicula_id', $id)
        ->delete();