app/Controllers/Dashboard/Pelicula.php

    public function index() {


        $peliculaModel = new PeliculaModel();

        /* $db = \Config\Database::connect();
        $builder = $db->table('peliculas'); */

        //return $builder->limit(10,20)->getCompiledSelect();


        $data = [
            'peliculas' => $peliculaModel
            ->select('peliculas.*, categorias.titulo as categoria')
            ->join('categorias', 'categorias.id = peliculas.categoria_id')
            ->paginate(10),'pager' => $peliculaModel->pager
            //->find()
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `peliculas`
JOIN `categorias` ON `categorias`.`id` = `peliculas`.`categoria_id`
SELECT `peliculas`.*, `categorias`.`titulo` as `categoria`
FROM `peliculas`
JOIN `categorias` ON `categorias`.`id` = `peliculas`.`categoria_id`
 LIMIT 10

    public function show($id) {
        $peliculaModel = new PeliculaModel();
        $imagenModel = new ImagenModel();

        //var_dump($peliculaModel->getImagesById($id));
        //var_dump($imagenModel->getPeliculasById(2));

        echo view('dashboard/pelicula/show', [
            'pelicula' => $peliculaModel->find($id),
            'imagenes' => $peliculaModel->getImagesById($id),
            'etiquetas' => $peliculaModel->getEtiquetasById($id)
        ]);
---
SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '102'

    public function new() {

        $categoriaModel = new CategoriaModel();


        echo view('dashboard/pelicula/new', [
            'pelicula' => new PeliculaModel(),
            'categorias' => $categoriaModel->find()
        ]);
---
SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '23'

    public function edit($id) {
        $peliculaModel = new PeliculaModel();
        $categoriaModel = new CategoriaModel();


        echo view('dashboard/pelicula/edit', [
            'pelicula' => $peliculaModel->find($id),
            'categorias' => $categoriaModel->find()
        ]);
---
SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '110'
SELECT *
FROM `categorias`