app/Controllers/Categoria.php

    public function index()
    {
        $categoriaModel = new CategoriaModel();
        echo view('categoria/index', [
            'categorias' => $categoriaModel->findAll()
        ]);
---
SELECT *
FROM `categorias`