app/Controllers/Pelicula.php

SELECT *
FROM `peliculas`
---
    public function index() {


        $peliculaModel = new PeliculaModel();
        //echo $peliculaModel->findAll()[0]['titulo'];

        echo view('pelicula/index', [
            'peliculas' => $peliculaModel->findAll()
        ]);

SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '1'
---
    public function edit($id) {
        $peliculaModel = new PeliculaModel();


        echo view('pelicula/edit', [
            'pelicula' => $peliculaModel->find($id)
        ]);