app/Models/PeliculaModel.php

SELECT `i`.*
FROM `peliculas`
JOIN `pelicula_imagen` as `pi` ON `pi`.`pelicula_id` = `peliculas`.`id`
JOIN `imagenes` as `i` ON `i`.`id` = `pi`.`imagen_id`
WHERE `peliculas`.`id` = '2'
---
    public function getImagesById($id) {
        return $this->select("i.*")
        ->join('pelicula_imagen as pi', 'pi.pelicula_id = peliculas.id')
        ->join('imagenes as i', 'i.id = pi.imagen_id')
        ->where('peliculas.id', $id)
        ->findAll();

SELECT `e`.*
FROM `peliculas`
JOIN `pelicula_etiqueta` as `pe` ON `pe`.`pelicula_id` = `peliculas`.`id`
JOIN `etiquetas` as `e` ON `e`.`id` = `pe`.`etiqueta_id`
WHERE `peliculas`.`id` = '2'
---
    public function getEtiquetasById($id) {
        return $this->select('e.*')
        ->join('pelicula_etiqueta as pe', 'pe.pelicula_id = peliculas.id')
        ->join('etiquetas as e', 'e.id = pe.etiqueta_id')
        ->where('peliculas.id', $id)
        ->findAll();